# SQL World Population

This project is slightly different than others you have encountered thus far on Codecademy. Instead of a step-by-step tutorial, this project contains a series of open-ended requirements which describe the project you’ll be building. There are many possible ways to correctly fulfill all of these requirements, and you should expect to use the internet, Codecademy, and other resources when you encounter a problem that you cannot easily solve.

You’ll work with a dataset of world population by country data from recent years. You’ll write queries to retrieve interesting data and answer a set of specific questions.

## Project 1

In [1]:
#Let us first load the SQL extension and establish a connection with the database
%load_ext sql

In [2]:
#connecting to database1
%sql sqlite:///db.sqlite

'Connected: @db.sqlite'

In this project, you’ll answer questions using a database of world population by country.

The schema of the database is:
- Column:
    - Country = STRING
    - population = NUMBER (in millions)
    - year = NUMBER
    
Refer to this schema as you write queries to the database.

When you finish this project, you should be able to answer each the questions that follow using a single SQL query.

1 - The first query has already been written for you to answer the following question:

What years are covered by the dataset? (you can manually count the number of years returned).

Continue adding your queries below the first one as you proceed.

In [3]:
%sql SELECT DISTINCT year from population_years;

 * sqlite:///db.sqlite
Done.

[(2000,),
 (2001,),
 (2002,),
 (2003,),
 (2004,),
 (2005,),
 (2006,),
 (2007,),
 (2008,),
 (2009,),
 (2010,)]

2 - What is the largest population size for Gabon in this dataset?

In [4]:
%sql SELECT Max(population) from population_years\
WHERE country = "Gabon"

 * sqlite:///db.sqlite
Done.

[(1.54526,)]

3 - What were the 10 lowest population countries in 2005?

In [5]:
%sql SELECT country from population_years\
WHERE year = 2005\
ORDER BY population ASC LIMIT 10

 * sqlite:///db.sqlite
Done.

[('Niue',),
 ('Falkland Islands (Islas Malvinas)',),
 ('Montserrat',),
 ('Saint Pierre and Miquelon',),
 ('Saint Helena',),
 ('Nauru',),
 ('Cook Islands',),
 ('Turks and Caicos Islands',),
 ('Virgin Islands, British',),
 ('Gibraltar',)]

4 - What are all the distinct countries with a population of over 100 million in the year 2010

In [6]:
%sql SELECT DISTINCT country from population_years\
WHERE population > 100 and YEAR = 2010

 * sqlite:///db.sqlite
Done.

[('Mexico',),
 ('United States',),
 ('Brazil',),
 ('Russia',),
 ('Nigeria',),
 ('Bangladesh',),
 ('China',),
 ('India',),
 ('Indonesia',),
 ('Japan',),
 ('Pakistan',)]

5 - How many countries in this dataset have the word “Islands” in their name?

In [7]:
%sql SELECT COUNT (*) from population_years\
WHERE country LIKE "%Islands%"

 * sqlite:///db.sqlite
Done.

[(99,)]

6 - What is the difference in population between 2000 and 2010 in Indonesia?

Note: it’s okay to figure out the difference by hand after pulling the correct data.

In [8]:
%sql SELECT * from population_years\
WHERE country = "Indonesia" and year = 2000\
OR country = "Indonesia" and year = 2010

 * sqlite:///db.sqlite
Done.

[('Indonesia', 214.67661, 2000), ('Indonesia', 242.96834, 2010)]

## Project 2

The schema of the database is:

countries:
- id = INTEGER (Primary Key)
- name = TEXT
- continent = TEXT

population_years:
 - id = INTEGER (Primary Key)
 - population = NUMBER (in millions)
 - year = NUMBER
 - country_id = INTEGER (Foreign Key)

Refer to this schema as you write queries to the database.

When you finish this project, you should be able to answer each the questions that follow using a single SQL query.

In [9]:
#connectin to database2
%sql sqlite:///db2.sqlite

'Connected: @db2.sqlite'

1 - How many entries in the countries table are from Africa?

In [10]:
%sql SELECT COUNT (*) from countries\
WHERE continent = "Africa"

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(56,)]

2 - What was the total population of the continent of Oceania in 2005?

In [11]:
%sql SELECT SUM(population) FROM population_years\
INNER JOIN countries ON\
countries.id = population_years.country_id\
WHERE year = 2005\
AND continent = 'Oceania';

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(32.664170000000006,)]

3 - What is the average population of countries in South America in 2003?

In [12]:
%sql SELECT AVG(population) FROM population_years\
INNER JOIN countries ON\
countries.id = population_years.country_id\
WHERE year = 2003\
AND continent = 'South America';

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(25.890651428571427,)]

4 - What country had the smallest population in 2007?

In [13]:
%sql SELECT MIN (population), name FROM population_years\
INNER JOIN countries ON\
countries.id = population_years.country_id\
WHERE year = 2007;

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(0.00216, 'Niue')]

5 - What is the average population of Poland during the time period covered by this dataset?

In [14]:
%sql SELECT AVG(population), name FROM population_years\
INNER JOIN countries ON\
countries.id = population_years.country_id\
WHERE name= "Poland";

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(38.56067909090909, 'Poland')]

6 - How many countries have the word “The” in their name?

In [15]:
%sql SELECT COUNT(*) FROM countries\
WHERE name LIKE "%The%";

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(4,)]

7 - What was the total population of each continent in 2010?

In [16]:
%sql SELECT SUM(population), continent FROM population_years\
INNER JOIN countries ON\
countries.id = population_years.country_id\
WHERE year = 2010\
GROUP BY continent;

   sqlite:///db.sqlite
 * sqlite:///db2.sqlite
Done.

[(1015.47846, 'Africa'),
 (4133.09148, 'Asia'),
 (723.06044, 'Europe'),
 (539.7945600000002, 'North America'),
 (34.956959999999995, 'Oceania'),
 (396.58234999999996, 'South America')]